Repository: michael-maia/APITestDocumentCreator
Catalog: APITestDocumentCreator/Resources/PrintStrings.*.resx
Languages: pt_br

# BasicApplicationStructureCreated
source: [INFO] Creating basic folder strucutre in the following path: {0}
pt_br: [INFO] Criada estrutura básica no seguinte caminho: {0}

# BasicApplicationStructureDescription
source: ## In this step the application will check if the base folders and files are already created or need creation.
pt_br: ## Nesta etapa a aplicação vai verificar se as pastas e arquivos de base já foram criados ou precisam ser criados.

# BasicApplicationStructureExists
source: [INFO] Basic folder structure already exists! No need for creation. The path is {0}
pt_br: [INFO] Estrutura básica do arquivo já existe! Não precisa criar-la. O caminho é {0}

# BasicApplicationStructureHighlightCreated
source: [INFO] Highlight file '{0}.txt' has been created inside the folder.
pt_br: [INFO] Arquivo de destaques '{0}.txt' foi criado dentro da pasta.

# BasicApplicationStructureHighlightExampleCreated
source: [INFO] Highlight file '{0}.txt' has been created inside the folder, with an example inside it.
pt_br: [INFO] Arquivo de destaque '{0}.txt' foi criado dentro da pasta, com um exemplo dentro.

# BasicApplicationStructureHighlightExists
source: [INFO] Highlight file already exist, please put the parameter names on it if you wish to highlight any parameter!
pt_br: [INFO] Arquivo de destaque já existe, por favor coloque os nomes dos parametros nele caso deseja dar destaque em algum parametro!

# BasicApplicationStructureInputCreated
source: [INFO] Input file '{0}.txt' has been created inside the folder.
pt_br: [INFO] Arquivo de entrada '{0}.txt' foi criado dentro da pasta.

# BasicApplicationStructureInputExampleCreated
source: [INFO] Input file '{0}.txt' has been created inside the folder, with an example inside it.
pt_br: [INFO] Arquivo de entrada '{0}.txt' foi criado dentro da pasta, com um exemplo dentro.

# BasicApplicationStructureInputExists
source: [INFO] Input file already exist, please check your data inside it!
pt_br: [INFO] Arquivo de entrada já existe, por favor verifique os dados nele!

# BasicApplicationStructureSectionCreated
source: [INFO] Section file '{0}.txt' has been created inside the folder.
pt_br: [INFO] Arquivo de seção '{0}.txt' foi criado dentro da pasta.

# BasicApplicationStructureSectionExampleCreated
source: [INFO] Section file '{0}.txt' has been created inside the folder, with an example inside it.
pt_br: [INFO] Arquivo de seção '{0}.txt' foi criado dentro da pasta, com um exemplo dentro.

# BasicApplicationStructureSectionExists
source: [INFO] Section data file already exist, please review if the file is in the correct pattern!
pt_br: [INFO] Arquivo de seção já existe, por favor revise se o arquivo está no padrão correto!

# BasicApplicationStructureTitle
source: BASIC APPLICATION STRUCTURE
pt_br: ESTRUTURA BÁSICA DA APLICAÇÃO

# DataPatternExplanationDescription
source: ## This is an important step of the application, where is explained how the 4 types of input files patterns are, pay attention to the details bellow and don't forget that each field in the text files are separated with a semi-colon (;).
pt_br: ## Esta é uma etapa importante da aplicação, onde é explicado como o padrão dos 4 tipos de arquivos de entrada são, preste atenção aos detalhes abaixo e não se esqueça de que cada campo é separado por ponto e vírgula (;) nos arquivos de texto.

# DataPatternExplanationHighlightParametersDescription
source: ## Here the objective is to read the parameters that you want to be highlighted in yellow, this part is completely optional, but if you want to highlight anything in the JSON, some fields are required.
pt_br: ## Aqui o objetivo é ler os parametros que você deseja que seja destacado em amarelo, esta parte é completamente opcional, mas se deseja destacar qualquer coisa no JSON alguns campos são obrigatórios.

# DataPatternExplanationHighlightParametersDescriptionParameterName
source: 1) PARAMETER NAME*: Name of the parameter inside the JSON (can be in the request or response).
pt_br: 1) NOME DO PARÂMETRO*: Nome do parâmetro dentro do JSON (pode ser na requisição ou resposta).

# DataPatternExplanationHighlightParametersDescriptionParameterNameReference
source: 3) PARAMETER NAME REFERENCE: If the parameter that will be highlighted is inside an array in the JSON with multiple objects, an example, you can define the name of the parameter that will be used as reference.
pt_br: 3) REFERÊNCIA DE NOME DO PARÂMETRO: Se o parâmetro que vai ser destacado está dentro de uma lista no JSON com múltiplos objetos, por exemplo, você pode definir o nome do parâmetro que será usado como referência.

# DataPatternExplanationHighlightParametersDescriptionParameterValueReference
source: 4) PARAMETER VALUE REFERENCE: If the parameter that will be highlighted is inside an array in the JSON with multiple objects, an example, you can define the value of the parameter that will be used as reference.
pt_br: 4) REFERÊNCIA DE VALOR DO PARÂMETRO: Se o parâmetro que vai ser destacado está dentro de uma lista no JSON com múltiplos objetos, por exemplo, você pode definir o valor do parâmetro que será usado como referência.

# DataPatternExplanationHighlightParametersDescriptionReminder
source: PS: If you wanna highlight a parameter based on another parameter / value reference, all fields need to be filled!
pt_br: OBS: Se você deseja destacar um parâmetro baseado em outro parâmetro / valor como referência, todos os campos são obrigatórios!

# DataPatternExplanationHighlightParametersDescriptionSectionNumberReference
source: 2) SECTION NUMBER REFERENCE: If you want to highlight a parameter only in a specific sector, fill only this reference field.
pt_br: 2) REFERÊNCIA DE NÚMERO DO SEÇÃO: Se deseja destacar um parâmetro somente em uma seção específica, preeencha somente somente este campo de referência.

# DataPatternExplanationInputDataDescription
source: ## The main file of the application, this is where all API request / response logs should be stored.
pt_br: ## Este é o arquivo principal da aplicação, aqui é onde os logs de todas as requisições / respostas da API devem ser armazenados.

# DataPatternExplanationInputDataDescriptionMethodName
source: 2) METHOD NAME*: Name of the API endpoint that will appear in the document close to it's respective JSON request and response.
pt_br: 2) NOME DO MÉTODO*: Nome do endpoint da API onde vai aparecer no documento junto com sua respectiva requisição e resposta.

# DataPatternExplanationInputDataDescriptionRequest
source: 4) REQUEST*: JSON used in the request (don't need pre-formatting).
pt_br: 4) REQUISIÇÃO*: JSON usado na requisição da API (não precisa de pré-formatação).

# DataPatternExplanationInputDataDescriptionResponse
source: 5) RESPONSE*: JSON received in the response (don't need pre-formatting).
pt_br: 5) RESPOSTA*: JSON recebido na repossta da API (não precisa de pré-formatação).

# DataPatternExplanationInputDataDescriptionSectionNumber
source: 1) SECTION NUMBER*: Section number in which all the input will be showed in the document, if the section has more than one input line, apply the same number but write in the order of appeareance.
pt_br: 1) NÚMERO DA SEÇÃO*: Número da seção do qual todas as entradas serão apresentadas no documento, se a seção tiver mais de uma linha de entrada, coloque o mesmo número mas escreva na ordem em que deve aparecer.

# DataPatternExplanationInputDataDescriptionURL
source: 3) URL*: URL used in the request to the API.
pt_br: 3) URL*: URL usada na requisição para a API.

# DataPatternExplanationPicturesDescription
source: ## This step is completely optional, but if you want to put some images on each section of the document, a pattern must be followed.
pt_br: ## Essa é etapa é completamente opcional, porém se deseja colocar algumas imagens em cada seção do documento, um padrão deve ser seguido.

# DataPatternExplanationPicturesImageName
source: IMAGE NAME: Each image must be declare by indicating its section and order, an example is '2_1.png' where this image is in sector 2 and is the first image to be showed.
pt_br: NOME DA IMAGEM: Cada imagem deve ser declarada através da indicação da sua seção e ordem, um exemplo é '2_1.png' onde esta imagem está na seção 2 e será a primeira imagem mostrada.

# DataPatternExplanationPicturesTitle
source: PICTURES FOLDER PATTERN
pt_br: PADRÃO DA PASTA PICTURES

# DataPatternExplanationSectionInformationDescription
source: ## In this file you will fill all informations about the sectors of the document.
pt_br: ## Neste arquivo você deve preenche-lo com todas as informações referente aos setores do documento.

# DataPatternExplanationSectionInformationDescriptionSection
source: 3) DESCRIPTION: A text that should briefly explain what happened in the sector.
pt_br: 3) DESCRIÇÃO: Um texto que deve brevemente explicar o que aconteceu nesse setor.

# DataPatternExplanationSectionInformationDescriptionSectionName
source: 2) SECTION NAME*: The name used to define the section.
pt_br: 2) NOME DA SEÇÃO*: Nome usado para definir a seção.

# DataPatternExplanationSectionInformationDescriptionSectionNumber
source: 1) SECTION NUMBER*: Number of the section that will be showed in the document.
pt_br: 1) NÚMERO DA SEÇÃO*: Número da seção a ser apresentado no documento.

# DataPatternExplanationTitle
source: DATA FILES - PATTERN EXPLANATION
pt_br: ARQUIVOS DE DADOS - EXPLICAÇÃO DO PADRÃO

# DataPatternValidationQuestion
source: > Before we continue with the validation of all files, review if the data inside the files is following its respective pattern. Option:
pt_br: > Antes de continuar com a validação de todos os quatro arquivos, revise se os dados inseridos estão de acordo com seu respectivo padrão. Opção:

# DataPatternValidationQuestionOptions
source: - Type '1' if it's OK - Type '2' to exit application Option:
pt_br: - Digite '1' se estiver OK - Digite '2' para sair da aplicação Opção:

# DocumentBasicInformationDescription
source: ## This step is to input some informations about the properties of the document.
pt_br: ## Esta etapa é para colocar algumas informações sobre as propriedades do documento.

# DocumentBasicInformationTitle
source: DOCUMENT PROPERTIES
pt_br: PROPRIEDADES DO DOCUMENTO

# DocumentBasicInformationTitleInput
source: > What is the title of the document? (The title will be the result file name too) Title:
pt_br: > Qual é o título do documento? (O título também vai ser o nome do arquivo final) Título:

# DocumentBasicInformationTitleInputEmptyValidation
source: [INFO] The title can't be empty! Please insert a new title:
pt_br: [INFO] O título não pode ser vazio! Por favor insira um novo título:

# DocumentBasicInformationTitleInputRegexValidation
source: [INFO] The title text can only contain the following: - NUMBERS (0-9) - ALPHABETICAL CHARACTERS (A-Z) - UNDERLINE (_) - HYPHEN (-) Please insert a new title:
pt_br: [INFO] O texto do título só pode conter o seguinte: - NÚMEROS (0-9) - CARACTERES ALFABÉTICOS (A-Z) - UNDERLINE (_) - HÍFEN (-) Por favor insira um novo título:

# DocumentCreatedConfirmation
source: [INFO] Document created in the following path: {0}\{1}.docx
pt_br: [INFO] Documento criado no seguinte caminho: {0}\{1}.docx

# DocumentCreationAlert
source: [INFO] Starting creation process.
pt_br: [INFO] Iniciando processo de criação.

# DocumentCreationTitle
source: DOCUMENT CREATION
pt_br: CRIAÇÃO DE DOCUMENTO

# ExitingApplication
source: [INFO] Exiting application...
pt_br: [INFO] Saindo da aplicação...

# InformationExampleDocumentation
source: [INFO] If is your first time using this application, it's possible to create an example document to see how it works, do you want to proceed with this example?
pt_br: [INFO] Se é sua primeira vez usando essa aplicação, é possível criar um documento de exemplo para ver como funciona, você deseja prosseguir com o exemplo?

# InputFilesValidationDescription
source: ## Here the application will make some validations on each file to verify if it follows what is expected.
pt_br: ## Aqui a aplicação vai realizar algumas validações em cada arquivo para verificar se está de acordo com o esperado.

# InputFilesValidationFailed
source: [ERROR] Some validations have failed, fix every error showed before and restart the application!
pt_br: [ERROR] Algumas validações falharam, ajuste cada erro antes de reiniciar a aplicação!

# InputFilesValidationHighlightParametersTest1
source: [ERROR | LINE {0}] The field 'Parameter Value' cannot be empty if the field 'Parameter Name' is filled!
pt_br: [ERROR | LINHA {0}] O campo 'Valor do Parâmetro' não pode ser vazio se o campo 'Nome do Parâmetro' estiver preenchido!

# InputFilesValidationInputDataTest1
source: [ERROR | LINE {0}] One of the fields in this line are empty!
pt_br: [ERROR | LINHA {0}] Um dos campos desta linha está vazio!

# InputFilesValidationInputDataTest2
source: [ERROR | LINE {0}] The first field of the line must be a INTEGER NUMBER!
pt_br: [ERROR | LINHA {0}] O primeiro campo da linha deve ser um NÚMERO INTEIRO!

# InputFilesValidationPassed
source: [INFO] All validations are OK and you can proceed with the creation of the document!
pt_br: [INFO] Todas as validações estão OK e você pode proceder com a criação do documento!

# InputFilesValidationPicturesFolderCounterEqualZero
source: [INFO] Nothing was found in the 'Pictures' folder!
pt_br: [INFO] Nada foi encontrado no diretório 'Pictures'.

# InputFilesValidationPicturesFolderCounterMoreThanZero
source: [INFO] {0} image(s) detected in the 'Pictures' folder!
pt_br: [INFO] {0} arquivo(s) encontrado(s).

# InputFilesValidationSectionInformationTest1
source: [ERROR | LINE {0}] Section number and / or section title are empty and both are need for the application!
pt_br: [ERROR | LINHA {0}] Número de seção e / ou título da seção estão vázios e ambos são necessários para a aplicação!

# InputFilesValidationSectionInformationTest2
source: [ERROR | LINE {0}] The first field of the line must be a INTEGER NUMBER!
pt_br: [ERROR | LINHA {0}] O primeiro campo da linha deve ser um NÚMERO INTEIRO!

# InputFilesValidationTitle
source: INPUT FILES VALIDATION
pt_br: VALIDAÇÃO DOS ARQUIVOS DE ENTRADA

# JSONDescriptionWord
source: Description
pt_br: Descrição

# JSONRequisitionWord
source: Request
pt_br: Requisição

# JSONResponseWord
source: Response
pt_br: Resposta

# PressAnyKeyStartCreation
source: Press any key to start creation...
pt_br: Pressione alguma tecla para iniciar a criação...

source: Press any key to exit application...
pt_br: Pressione qualquer tecla para sair da aplicação...

source: Press any key to proceed...
pt_br: Pressione alguma tecla para proceder...

# PrintGenericErrorException
source: [ERROR]: An error has occurred! See details below: {0}
pt_br: [ERROR]: Ocorreu um erro! Veja os detalhes abaixo: {0}

source: * - Required field.
pt_br: * - Campo obrigatório.

# UserDecisionApplicationLanguage
source: [INFO] You chose English language!
pt_br: [INFO] Você escolheu a língua Português Brasileiro!

# UserDecisionExampleDocumentation
source: - Type '1' to create example - Type '2' to customize input data Option:
pt_br: - Aperte '1' para criar o exemplo - Aperte '2' para customizar os dados de entrada Opção:

# UserDecisionOptionOneExampleDocumentation
source: [INFO] User chose to proceed with example!
pt_br: [INFO] Usuário escolheu proceder com o exemplo!

# UserDecisionOptionTwoExampleDocumentation
source: [INFO] User will input it's own data!
pt_br: [INFO] Usuário vai colocar seus próprios dados!
